[
  {
    "_id": "64f1a2b3c4d5e6f7890a1b01",
    "scholarshipName": "Global Excellence Scholarship",
    "scholarshipDescription": "The Global Excellence Scholarship is a highly prestigious international scholarship designed for outstanding students who demonstrate exceptional academic performance, strong leadership qualities, and a clear vision for their future career. This scholarship aims to support talented international students by providing them with the opportunity to pursue advanced higher education at the University of Oxford, one of the world’s top-ranked universities. The program places a strong emphasis on academic excellence, leadership potential, and the ability to contribute positively to the academic community and society. It is especially suitable for students with a strong background in Computer Science, encouraging innovation, research excellence, and critical problem-solving skills in modern technological fields.",
    "stipendCoverage": "This is a fully funded scholarship that covers nearly all major expenses related to studying abroad. The scholarship provides full tuition fee coverage for the entire duration of the program, ensuring students do not need to pay academic fees. In addition, selected students receive a monthly living stipend to cover daily expenses such as food, transportation, and personal costs. An accommodation allowance is included to support housing expenses in university-approved residences. Comprehensive health insurance coverage is also provided throughout the study period, allowing students to focus entirely on their education without financial stress..",
    "universityName": "University of Oxford",
    "universityImage": "https://researchresearch-news-wordpress-media-live.s3.eu-west-1.amazonaws.com/2020/03/oxford_university_radcliff_camera.png",
    "universityCountry": "UK",
    "universityCity": "Oxford",
    "location": "UK",
    "universityWorldRank": 2,
    "subjectCategory": "Computer Science",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 100,
    "serviceCharge": 50,
    "applicationDeadline": "2026-01-15",
    "scholarshipPostDate": "2025-12-01",
    "postedUserEmail": "oxford.admin@eduportal.com"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b02",
    "scholarshipName": "Harvard Merit Award",
    "scholarshipDescription": "The Harvard Merit Award is a competitive, merit-based scholarship designed to recognize and support high-achieving undergraduate students who demonstrate exceptional academic performance, intellectual curiosity, and strong potential for future success. This scholarship is awarded to students who have consistently excelled in their studies and shown dedication to academic excellence. Offered by Harvard University, the program aims to reduce financial barriers and encourage talented students to pursue a Bachelor’s degree in Business while actively engaging in academic, leadership, and extracurricular activities. Selection is based primarily on academic merit, along with overall academic commitment and achievement..",
    "stipendCoverage": "This scholarship provides partial financial support to help reduce the overall cost of undergraduate education. The award includes a partial tuition fee waiver, significantly lowering the amount students need to pay for academic fees. In addition, recipients receive a yearly academic grant to assist with education-related expenses such as books, learning materials, and other academic costs. While it does not cover all expenses, the Harvard Merit Award offers valuable financial assistance that helps students focus more on their studies and academic growth.",
    "universityName": "Harvard University",
    "universityImage": "https://img.freepik.com/free-vector/harvard-hall-university-buildings-vector-cartoon-style_1308-160402.jpg?semt=ais_hybrid&w=740&q=80",
    "universityCountry": "USA",
    "universityCity": "Cambridge",
    "location": "USA",
    "universityWorldRank": 5,
    "subjectCategory": "Business",
    "scholarshipCategory": "Partial",
    "degree": "Bachelor",
    "tuitionFees": 22000,
    "applicationFees": 75,
    "serviceCharge": 40,
    "applicationDeadline": "2026-02-10",
    "scholarshipPostDate": "2025-12-02",
    "postedUserEmail": "harvard.scholar@studyhub.org"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b03",
    "scholarshipName": "MIT Future Engineers",
    "scholarshipDescription": "The MIT Future Engineers Scholarship is a prestigious, fully-funded program designed to support highly talented undergraduate students who demonstrate exceptional skills, creativity, and a strong passion for engineering and technology. This scholarship targets aspiring engineers who show outstanding innovation, research excellence, and leadership potential. By providing access to MIT’s world-class resources and academic environment, the program encourages students to push the boundaries of engineering knowledge and contribute meaningfully to technological advancements. Selection is based on academic merit, innovative thinking, problem-solving capabilities, and the candidate’s potential to make an impact in the field of engineering.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, enabling students to focus entirely on their academic and research pursuits. The scholarship includes full tuition fee coverage, a monthly living stipend for day-to-day expenses, and dedicated research funding to support projects, lab work, or other academic initiatives. Additionally, students may receive access to resources, mentorship, and networking opportunities within MIT, ensuring a comprehensive environment for academic and professional growth.",
    "universityName": "MIT",
    "universityImage": "https://news.mit.edu/sites/default/files/styles/news_article__image_gallery/public/images/201609/%2520Aerial-credit-AboveSummit-Christopher%2520Harting_0.png?itok=C0l2B8Sr",
    "universityCountry": "USA",
    "universityCity": "Cambridge",
    "location": "USA",
    "universityWorldRank": 1,
    "subjectCategory": "Engineering",
    "scholarshipCategory": "Full Fund",
    "degree": "Bachelor",
    "tuitionFees": 0,
    "applicationFees": 90,
    "serviceCharge": 45,
    "applicationDeadline": "2026-01-25",
    "scholarshipPostDate": "2025-12-03",
    "postedUserEmail": "mit.grants@globaledu.net"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b04",
    "scholarshipName": "Toronto International Grant",
    "scholarshipDescription": "The Toronto International Grant is a competitive scholarship aimed at supporting exceptional international postgraduate students pursuing studies in medical sciences. This program recognizes students with strong academic performance, research potential, and a dedication to advancing healthcare knowledge. Offered by the University of Toronto, the scholarship seeks to reduce financial barriers for talented students while encouraging them to actively contribute to medical research, clinical innovation, and academic excellence. Selection is based on academic merit, research aptitude, and the applicant’s potential impact in the field of medical sciences.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover the costs of postgraduate education. It includes a partial tuition fee support, reducing the overall academic expenses, and an accommodation allowance to assist with housing costs. While it does not fully cover all expenses, the Toronto International Grant significantly eases the financial burden, allowing students to focus on their studies, research projects, and professional development in the medical field.",
    "universityName": "University of Toronto",
    "universityImage": "https://www.transitionresourceguide.ca/sites/default/files/styles/hero_image/public/img/hero/Toronto_1.png?itok=wR-ARmuI",
    "universityCountry": "Canada",
    "universityCity": "Toronto",
    "location": "Canada",
    "universityWorldRank": 18,
    "subjectCategory": "Medical",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 15000,
    "applicationFees": 60,
    "serviceCharge": 30,
    "applicationDeadline": "2026-03-05",
    "scholarshipPostDate": "2025-12-04",
    "postedUserEmail": "utoronto.office@scholarships.ca"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b05",
    "scholarshipName": "Asia Bright Minds",
    "scholarshipDescription": "The Asia Bright Minds Scholarship is a prestigious, fully-funded program designed to recognize and support high-achieving Asian students pursuing advanced studies in technology and computer science. Offered by the National University of Singapore, this scholarship targets students who demonstrate exceptional academic performance, innovative thinking, and leadership potential in their field. The program aims to foster a new generation of tech leaders and innovators in Asia by providing access to world-class education, research opportunities, and professional development resources. Selection is based on academic excellence, creativity, and the candidate’s potential to make a significant impact in the technology sector.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, enabling students to focus entirely on their studies and research. It includes full tuition fee coverage, a monthly living stipend to support daily expenses, and housing support to ensure comfortable accommodation during the study period. The scholarship also provides access to university resources, mentorship programs, and networking opportunities, fostering both academic and professional growth.",
    "universityName": "National University of Singapore",
    "universityImage": "https://mcdonnell.washu.edu/app/uploads/2025/05/NUS.png",
    "universityCountry": "Singapore",
    "universityCity": "Singapore",
    "location": "Asia",
    "universityWorldRank": 9,
    "subjectCategory": "Computer Science",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 50,
    "serviceCharge": 30,
    "applicationDeadline": "2026-01-30",
    "scholarshipPostDate": "2025-12-05",
    "postedUserEmail": "nus.scholar@asiaedu.org"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b06",
    "scholarshipName": "Stanford AI Fellowship",
    "scholarshipDescription": "The Stanford AI Fellowship is a prestigious, fully-funded program designed to support exceptional students pursuing advanced studies in Artificial Intelligence and Machine Learning. This fellowship targets students who demonstrate outstanding academic performance, innovative research capabilities, and a strong commitment to advancing the field of AI. Offered by Stanford University, the program provides access to world-class faculty, cutting-edge research facilities, and a collaborative environment that fosters innovation and technical excellence. Selection is based on academic merit, research achievements, and the potential to make significant contributions to AI and related technologies.",
    "stipendCoverage": "This fully funded fellowship covers all major educational and living expenses, allowing students to focus entirely on their research and studies. It includes full tuition coverage, a monthly living stipend for day-to-day expenses, and dedicated lab funding to support research projects, experiments, and AI initiatives. Fellows also gain access to university resources, mentorship programs, and networking opportunities, ensuring comprehensive support for academic and professional growth.",
    "universityName": "Stanford University",
    "universityImage": "https://stanforddaily.com/wp-content/uploads/2025/02/mainquad.jpg",
    "universityCountry": "USA",
    "universityCity": "Stanford",
    "location": "USA",
    "universityWorldRank": 6,
    "subjectCategory": "Computer Science",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 95,
    "serviceCharge": 50,
    "applicationDeadline": "2026-02-01",
    "scholarshipPostDate": "2025-12-06",
    "postedUserEmail": "stanford.ai@edufinder.io"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b07",
    "scholarshipName": "Canada Research Scholarship",
    "scholarshipDescription": "The Canada Research Scholarship is a competitive program designed to support both Canadian and international students pursuing innovative research projects in engineering and related fields. Offered by the University of British Columbia, this scholarship targets students who demonstrate strong academic performance, research aptitude, and the potential to contribute meaningfully to scientific and technological advancements. The program encourages creativity, critical thinking, and problem-solving skills, providing a platform for students to undertake impactful research initiatives. Selection is based on academic merit, research potential, and the applicant’s ability to drive innovation.",
    "stipendCoverage": "This scholarship provides partial financial support to assist with the costs of postgraduate education and research. It includes partial tuition coverage, a monthly living stipend to support day-to-day expenses, and a dedicated research allowance to fund projects, laboratory work, or other academic initiatives. While not fully covering all expenses, the Canada Research Scholarship offers substantial support that allows students to focus on their studies and research while reducing financial pressures.",
    "universityName": "University of British Columbia",
    "universityImage": "https://media.istockphoto.com/id/482096102/photo/university-campus.jpg?s=612x612&w=0&k=20&c=27UB8xFxrZvhgMmzmCu7a9bYnLan8IJ94BMuilXq4hg=",
    "universityCountry": "Canada",
    "universityCity": "Vancouver",
    "location": "Canada",
    "universityWorldRank": 34,
    "subjectCategory": "Engineering",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 12000,
    "applicationFees": 55,
    "serviceCharge": 25,
    "applicationDeadline": "2026-03-12",
    "scholarshipPostDate": "2025-12-07",
    "postedUserEmail": "ubc.research@studycanada.ca"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b08",
    "scholarshipName": "UK Leadership Award",
    "scholarshipDescription": "The UK Leadership Award is a prestigious scholarship designed to recognize and support undergraduate students in the UK who demonstrate exceptional leadership qualities alongside strong academic performance. Offered by the University of Manchester, this program aims to nurture future leaders who can make a positive impact in their communities and professional fields. Selection is based on academic merit, leadership potential, and the student’s demonstrated ability to contribute meaningfully to campus and society at large. The scholarship encourages a balance of academic excellence, extracurricular involvement, and personal development.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help reduce the cost of undergraduate education. It includes partial tuition coverage and an annual leadership grant to support academic, extracurricular, and personal development activities. While it does not fully cover all expenses, the UK Leadership Award offers valuable financial support that enables students to focus on their studies, leadership initiatives, and overall growth.",
    "universityName": "University of Manchester",
    "universityImage": "https://keystoneacademic-res.cloudinary.com/image/upload/c_limit,w_1920/dpr_auto/f_auto/q_auto/v1/element/24/246362_246287_other_images-graduation_third_party.png",
    "universityCountry": "UK",
    "universityCity": "Manchester",
    "location": "UK",
    "universityWorldRank": 51,
    "subjectCategory": "Business",
    "scholarshipCategory": "Partial",
    "degree": "Bachelor",
    "tuitionFees": 17000,
    "applicationFees": 70,
    "serviceCharge": 35,
    "applicationDeadline": "2026-02-18",
    "scholarshipPostDate": "2025-12-08",
    "postedUserEmail": "manchester.lead@ukedu.co"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b09",
    "scholarshipName": "Asia Engineering Grant",
    "scholarshipDescription": "The Asia Engineering Grant is a prestigious, fully-funded scholarship aimed at supporting top-performing Asian students pursuing advanced studies in engineering disciplines. Offered by the University of Tokyo, this program targets students who demonstrate exceptional academic performance, research excellence, and innovation potential. The scholarship encourages students to contribute to cutting-edge engineering projects and technological advancements in their field. Selection is based on academic merit, research capability, and the potential to make significant contributions to the engineering sector.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus fully on their studies and research. It includes full tuition coverage, a monthly living stipend for daily expenses, and dedicated research funding to support lab work, projects, and academic initiatives. Additionally, students gain access to university resources, mentorship, and professional development opportunities, fostering both academic and career growth.",
    "universityName": "University of Tokyo",
    "universityImage": "https://png.pngtree.com/thumb_back/fh260/background/20220301/pngtree-university-of-tokyos-yasuda-auditorium-in-tokyo-on-november-22nd-photo-image_12431608.jpg",
    "universityCountry": "Japan",
    "universityCity": "Tokyo",
    "location": "Asia",
    "universityWorldRank": 23,
    "subjectCategory": "Engineering",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 45,
    "serviceCharge": 25,
    "applicationDeadline": "2026-01-20",
    "scholarshipPostDate": "2025-12-09",
    "postedUserEmail": "tokyo.eng@asiaedu.jp"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b11",
    "scholarshipName": "Silicon Valley Tech Scholarship",
    "scholarshipDescription": "The Silicon Valley Tech Scholarship is a competitive program designed to support undergraduate students who demonstrate exceptional innovation, technical skills, and academic performance in computer science. Offered by the University of California, Berkeley, this scholarship aims to nurture future technology leaders by providing financial support, mentorship, and access to cutting-edge resources. Selection is based on academic merit, creativity, and the potential to contribute meaningfully to the tech industry through innovation and problem-solving.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover tuition and living expenses. It includes a partial tuition waiver, a monthly living allowance to support daily expenses, and access to a structured mentorship program to guide students in their academic and professional development. While it does not fully cover all costs, the Silicon Valley Tech Scholarship significantly eases financial burdens and encourages students to focus on their studies, innovation, and career growth in technology.",
    "universityName": "University of California, Berkeley",
    "universityImage": "https://i.namu.wiki/i/hCZ0gvcQwSbgPkDOWZm3QMqKDG1fpUhNIsCXPTSoUvv7_WqfcBG4JQBv4oSrXTZ8ex_aPINh6-yV2KZvkxNDPg.webp",
    "universityCountry": "USA",
    "universityCity": "Berkeley",
    "location": "USA",
    "universityWorldRank": 27,
    "subjectCategory": "Computer Science",
    "scholarshipCategory": "Partial",
    "degree": "Bachelor",
    "tuitionFees": 18000,
    "applicationFees": 80,
    "serviceCharge": 35,
    "applicationDeadline": "2026-02-22",
    "scholarshipPostDate": "2025-12-11",
    "postedUserEmail": "berkeley.cs@studyusa.org"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b12",
    "scholarshipName": "UK Innovation Fund",
    "scholarshipDescription": "The UK Innovation Fund is a competitive scholarship designed to support UK students pursuing innovative projects across various disciplines, with a focus on engineering and technological development. Offered by the University of Bristol, this program targets students who demonstrate strong academic performance, creativity, and the potential to drive impactful innovations. The scholarship encourages students to undertake forward-thinking projects, develop practical solutions, and contribute meaningfully to their field. Selection is based on academic merit, project proposal quality, and the student’s potential to make a significant impact.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover tuition and project-related expenses. It includes partial tuition coverage and dedicated funding to support research or innovation projects. While it does not fully cover all costs, the UK Innovation Fund offers valuable support that allows students to focus on their studies, project development, and professional growth.",
    "universityName": "University of Bristol",
    "universityImage": "https://www.shutterstock.com/image-photo/bristol-uk-november-11-2023-600nw-2418957143.jpg",
    "universityCountry": "UK",
    "universityCity": "Bristol",
    "location": "UK",
    "universityWorldRank": 58,
    "subjectCategory": "Engineering",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 13000,
    "applicationFees": 60,
    "serviceCharge": 30,
    "applicationDeadline": "2026-03-14",
    "scholarshipPostDate": "2025-12-12",
    "postedUserEmail": "bristol.innovation@ukedu.co"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b13",
    "scholarshipName": "Canadian Future Leaders",
    "scholarshipDescription": "The Canadian Future Leaders Scholarship is a prestigious, fully-funded program designed to recognize and support exceptional students who demonstrate strong leadership potential, academic excellence, and a commitment to making a positive impact in research, business, and society. Offered by McGill University, this scholarship encourages students to develop their skills, pursue innovative projects, and contribute meaningfully to their communities. Selection is based on academic merit, leadership qualities, and the candidate’s ability to influence positive change in their field.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus entirely on their studies and leadership development. It includes full tuition coverage and a dedicated leadership development stipend to support personal and professional growth. Additionally, recipients gain access to mentorship, networking opportunities, and university resources to enhance their academic and career trajectory.",
    "universityName": "McGill University",
    "universityImage": "https://images.shiksha.com/mediadata/images/1513922151phpyhMkzk_g.png",
    "universityCountry": "Canada",
    "universityCity": "Montreal",
    "location": "Canada",
    "universityWorldRank": 31,
    "subjectCategory": "Business",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 65,
    "serviceCharge": 30,
    "applicationDeadline": "2026-01-28",
    "scholarshipPostDate": "2025-12-13",
    "postedUserEmail": "mcgill.leaders@canadaedu.ca"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b14",
    "scholarshipName": "Asia Medical Excellence",
    "scholarshipDescription": "The Asia Medical Excellence Scholarship is a prestigious, fully-funded program designed to support top-performing medical students in Asia who demonstrate exceptional academic achievement, research excellence, and a commitment to advancing healthcare. Offered by Seoul National University, this scholarship encourages students to engage in cutting-edge medical research, clinical projects, and innovation in healthcare practices. Selection is based on academic merit, research potential, and the applicant’s ability to make meaningful contributions to the medical field.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus entirely on their studies and research. It includes full tuition coverage, a monthly living stipend to support day-to-day expenses, and dedicated funding for clinical research and academic initiatives. Additionally, students gain access to university resources, mentorship programs, and professional development opportunities to foster both academic and career growth.",
    "universityName": "Seoul National University",
    "universityImage": "https://en.snu.ac.kr/webdata/uploads/eng/image/2020/02/index-campas-img01.jpg",
    "universityCountry": "South Korea",
    "universityCity": "Seoul",
    "location": "Asia",
    "universityWorldRank": 36,
    "subjectCategory": "Medical",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 40,
    "serviceCharge": 20,
    "applicationDeadline": "2026-02-05",
    "scholarshipPostDate": "2025-12-14",
    "postedUserEmail": "snu.med@asiaedu.kr"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b15",
    "scholarshipName": "USA Data Science Grant",
    "scholarshipDescription": "The USA Data Science Grant is a competitive scholarship designed to support students excelling in data science, analytics, and related research fields. Offered by Columbia University, this program targets students with outstanding academic performance, strong analytical skills, and the potential to contribute meaningfully to advancements in data-driven technologies. The scholarship encourages students to engage in innovative projects, research initiatives, and professional development within the data science domain. Selection is based on academic merit, research capability, and the applicant’s potential impact in the field.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover tuition and research-related expenses. It includes partial tuition coverage, a monthly living stipend to support daily expenses, and dedicated funding for data science projects and academic initiatives. While it does not fully cover all costs, the USA Data Science Grant offers valuable support to help students focus on their studies, research, and professional growth in data science.",
    "universityName": "Columbia University",
    "universityImage": "https://plus.unsplash.com/premium_photo-1697729617750-aac974815e4d?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "universityCountry": "USA",
    "universityCity": "New York",
    "location": "USA",
    "universityWorldRank": 19,
    "subjectCategory": "Computer Science",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 16000,
    "applicationFees": 85,
    "serviceCharge": 40,
    "applicationDeadline": "2026-03-18",
    "scholarshipPostDate": "2025-12-15",
    "postedUserEmail": "columbia.ds@edufinder.com"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b16",
    "scholarshipName": "UK Arts & Humanities Award",
    "scholarshipDescription": "The UK Arts & Humanities Award is a competitive scholarship designed to support undergraduate students pursuing studies in arts, humanities, and related fields in the UK. Offered by the University of Leeds, this program targets students who demonstrate strong academic performance, creativity, and a commitment to advancing knowledge and cultural understanding in their discipline. Selection is based on academic merit, artistic or scholarly achievements, and the student’s potential to contribute meaningfully to their field and community.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help reduce educational costs. It includes partial tuition coverage and a research grant to support academic or creative projects. While it does not cover all expenses, the UK Arts & Humanities Award offers valuable support that enables students to focus on their studies, research, and personal development.",
    "universityName": "University of Leeds",
    "universityImage": "https://images.unsplash.com/photo-1681642048507-eda6aa987b6a?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8VW5pdmVyc2l0eSUyMG9mJTIwTGVlZHN8ZW58MHx8MHx8fDA%3D",
    "universityCountry": "UK",
    "universityCity": "Leeds",
    "location": "UK",
    "universityWorldRank": 75,
    "subjectCategory": "Business",
    "scholarshipCategory": "Self Fund",
    "degree": "Bachelor",
    "tuitionFees": 14000,
    "applicationFees": 55,
    "serviceCharge": 25,
    "applicationDeadline": "2026-02-27",
    "scholarshipPostDate": "2025-12-16",
    "postedUserEmail": "leeds.admin@ukstudy.net"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b17",
    "scholarshipName": "Canada Engineering Pathway",
    "scholarshipDescription": "The Canada Engineering Pathway Scholarship is a competitive program designed to support top-performing undergraduate students in engineering disciplines across Canada. Offered by the University of Alberta, this scholarship targets students who demonstrate strong academic achievement, research potential, and a commitment to advancing engineering knowledge and innovation. Selection is based on academic merit, project involvement, and the applicant’s potential to contribute meaningfully to the engineering field.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover tuition and research-related expenses. It includes partial tuition coverage and a monthly research allowance to support academic projects and daily expenses. While it does not fully cover all costs, the Canada Engineering Pathway Scholarship offers valuable support, enabling students to focus on their studies, research, and professional growth.",
    "universityName": "University of Alberta",
    "universityImage": "https://plus.unsplash.com/premium_photo-1697729748864-4e2d548a48e1?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8VW5pdmVyc2l0eSUyMG9mJTIwQWxiZXJ0YXxlbnwwfHwwfHx8MA%3D%3D",
    "universityCountry": "Canada",
    "universityCity": "Edmonton",
    "location": "Canada",
    "universityWorldRank": 110,
    "subjectCategory": "Engineering",
    "scholarshipCategory": "Partial",
    "degree": "Bachelor",
    "tuitionFees": 12000,
    "applicationFees": 50,
    "serviceCharge": 25,
    "applicationDeadline": "2026-01-19",
    "scholarshipPostDate": "2025-12-17",
    "postedUserEmail": "alberta.eng@canadastudy.ca"
  },
  {
    "_id": "64f1a2b3c4d5e6f7890a1b18",
    "scholarshipName": "Asia Leadership Scholarship",
    "scholarshipDescription": "The Asia Leadership Scholarship is a prestigious, fully-funded program designed to support emerging leaders in Asia who demonstrate exceptional academic achievement, leadership potential, and a commitment to making a positive impact in their communities and professional fields. Offered by Tsinghua University, this scholarship encourages students to develop leadership skills, engage in innovative projects, and contribute meaningfully to society. Selection is based on academic excellence, leadership qualities, and the candidate’s potential to drive positive change.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus entirely on their studies and leadership development. It includes full tuition coverage and access to a structured leadership mentorship program. Additionally, recipients gain access to university resources, professional networks, and development opportunities to enhance their academic and career growth.",
    "universityName": "Tsinghua University",
    "universityImage": "https://images.unsplash.com/photo-1712490142969-386da61558d5?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTR8fFRzaW5naHVhJTIwVW5pdmVyc2l0eXxlbnwwfHwwfHx8MA%3D%3D",
    "universityCountry": "China",
    "universityCity": "Beijing",
    "location": "Asia",
    "universityWorldRank": 17,
    "subjectCategory": "Business",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 40,
    "serviceCharge": 20,
    "applicationDeadline": "2026-03-07",
    "scholarshipPostDate": "2025-12-18",
    "postedUserEmail": "tsinghua.lead@asiaedu.cn"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b19",
    "scholarshipName": "UK Science Innovators",
    "scholarshipDescription": "The UK Science Innovators Scholarship is a competitive program designed to support students developing innovative scientific projects and research in various fields of science. Offered by the University of Edinburgh, this scholarship targets students who demonstrate strong academic performance, creativity, and research potential. The program encourages students to engage in cutting-edge scientific research, problem-solving, and practical applications. Selection is based on academic merit, innovation potential, and the ability to contribute meaningfully to scientific advancements.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover tuition and research-related expenses. It includes partial tuition coverage, a monthly living stipend to support daily expenses, and dedicated lab funding for research projects. While it does not fully cover all costs, the UK Science Innovators Scholarship offers valuable support to enable students to focus on their studies, research, and professional development in science.",
    "universityName": "University of Edinburgh",
    "universityImage": "https://images.unsplash.com/photo-1713713717218-0b7878830cc5?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8dW5pdmVyc2l0eSUyMG9mJTIwZWRpbmJ1cmdofGVufDB8fDB8fHww",
    "universityCountry": "UK",
    "universityCity": "Edinburgh",
    "location": "UK",
    "universityWorldRank": 22,
    "subjectCategory": "Science",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 15000,
    "applicationFees": 70,
    "serviceCharge": 35,
    "applicationDeadline": "2026-02-08",
    "scholarshipPostDate": "2025-12-19",
    "postedUserEmail": "edinburgh.science@ukedu.co"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b20",
    "scholarshipName": "USA Global Leadership",
    "scholarshipDescription": "The USA Global Leadership Scholarship is a prestigious, fully-funded program designed to support students who excel in leadership, research, and academic performance. Offered by Yale University, this scholarship targets students with exceptional potential to drive positive change in their communities and professional fields. The program encourages recipients to develop leadership skills, engage in innovative projects, and contribute meaningfully to academic and societal progress. Selection is based on academic merit, leadership qualities, and the ability to make a significant impact.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus entirely on their studies and leadership development. It includes full tuition coverage and an annual leadership stipend. Additionally, recipients gain access to mentorship programs, professional networks, and university resources to support both academic and career growth.",
    "universityName": "Yale University",
    "universityImage": "https://images.unsplash.com/20/cambridge.JPG?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8WWFsZSUyMFVuaXZlcnNpdHl8ZW58MHx8MHx8fDA%3D",
    "universityCountry": "USA",
    "universityCity": "New Haven",
    "location": "USA",
    "universityWorldRank": 14,
    "subjectCategory": "Business",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 90,
    "serviceCharge": 45,
    "applicationDeadline": "2026-01-22",
    "scholarshipPostDate": "2025-12-20",
    "postedUserEmail": "yale.leaders@edufinder.com"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b21",
    "scholarshipName": "Asia Tech Innovators",
    "scholarshipDescription": "The Asia Tech Innovators Scholarship is a prestigious, fully-funded program designed to support Asian students who are developing innovative technology solutions with potential global impact. Offered by KAIST, this scholarship targets students demonstrating exceptional academic performance, creativity, and leadership in engineering and technology fields. The program encourages students to pursue cutting-edge projects, contribute to technological advancements, and engage in professional development. Selection is based on academic merit, innovation potential, and the ability to make a significant impact in technology.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus entirely on their studies and technology projects. It includes full tuition coverage, a monthly living stipend to support daily expenses, and access to structured mentorship programs. Additionally, recipients gain access to university resources, networking opportunities, and professional development initiatives to foster academic and career growth.",
    "universityName": "KAIST",
    "universityImage": "https://images.unsplash.com/photo-1747854828989-5c8408a8f0bc?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NHx8S0FJU1R8ZW58MHx8MHx8fDA%3D",
    "universityCountry": "South Korea",
    "universityCity": "Daejeon",
    "location": "Asia",
    "universityWorldRank": 39,
    "subjectCategory": "Engineering",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 45,
    "serviceCharge": 20,
    "applicationDeadline": "2026-02-15",
    "scholarshipPostDate": "2025-12-21",
    "postedUserEmail": "kaist.tech@asiaedu.kr"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b22",
    "scholarshipName": "UK Social Impact Award",
    "scholarshipDescription": "The UK Social Impact Award is a competitive scholarship designed to support students contributing to meaningful social impact projects in the UK. Offered by the University of Glasgow, this program targets students who demonstrate strong academic performance, leadership skills, and a commitment to driving positive change in society. Selection is based on academic merit, the quality of social initiatives, and the applicant’s potential to make a significant contribution to community and social development.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover tuition and project-related expenses. It includes partial tuition coverage and a dedicated grant to support social impact initiatives. While it does not fully cover all costs, the UK Social Impact Award offers valuable support that enables students to focus on their studies, projects, and professional development in social impact fields.",
    "universityName": "University of Glasgow",
    "universityImage": "https://images.unsplash.com/photo-1589982334462-f1cead0e1519?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8VW5pdmVyc2l0eSUyMG9mJTIwR2xhc2dvd3xlbnwwfHwwfHx8MA%3D%3D",
    "universityCountry": "UK",
    "universityCity": "Glasgow",
    "location": "UK",
    "universityWorldRank": 77,
    "subjectCategory": "Social Science",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 13000,
    "applicationFees": 60,
    "serviceCharge": 30,
    "applicationDeadline": "2026-03-02",
    "scholarshipPostDate": "2025-12-22",
    "postedUserEmail": "glasgow.social@ukedu.co"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b23",
    "scholarshipName": "Canada Future Entrepreneurs",
    "scholarshipDescription": "The Canada Future Entrepreneurs Scholarship is a prestigious, fully-funded program designed to support both Canadian and international students pursuing studies in entrepreneurship and business innovation. Offered by the University of Waterloo, this scholarship targets students who demonstrate exceptional academic performance, creativity, and leadership potential in business ventures. The program encourages students to develop entrepreneurial projects, engage in innovative business solutions, and contribute meaningfully to the startup ecosystem. Selection is based on academic merit, entrepreneurial potential, and the candidate’s ability to make a significant impact in business and innovation.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus entirely on their studies and entrepreneurial initiatives. It includes full tuition coverage, a monthly living stipend to support daily expenses, and access to a structured mentorship program. Additionally, recipients gain access to university resources, professional networks, and development opportunities to foster both academic and career growth.",
    "universityName": "University of Waterloo",
    "universityImage": "https://plus.unsplash.com/premium_photo-1733342512055-223c9b362ade?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "universityCountry": "Canada",
    "universityCity": "Waterloo",
    "location": "Canada",
    "universityWorldRank": 147,
    "subjectCategory": "Business",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 55,
    "serviceCharge": 25,
    "applicationDeadline": "2026-01-18",
    "scholarshipPostDate": "2025-12-23",
    "postedUserEmail": "waterloo.entrepreneur@canadaedu.ca"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b24",
    "scholarshipName": "Asia AI Leaders",
    "scholarshipDescription": "The Asia AI Leaders Scholarship is a prestigious, fully-funded program designed to support Asian students who demonstrate excellence in Artificial Intelligence research and innovation. Offered by the Hong Kong University of Science and Technology, this scholarship targets students with outstanding academic performance, research capabilities, and leadership potential in AI and computer science fields. The program encourages students to engage in cutting-edge AI research, develop innovative solutions, and contribute meaningfully to technological advancements. Selection is based on academic merit, research excellence, and the potential to make a significant impact in AI.",
    "stipendCoverage": "This fully funded scholarship covers all major educational and living expenses, allowing students to focus entirely on their studies and AI research. It includes full tuition coverage, a monthly living stipend to support daily expenses, and dedicated lab funding for research projects. Additionally, recipients gain access to university resources, mentorship programs, and professional development opportunities to foster academic and career growth.",
    "universityName": "Hong Kong University of Science and Technology",
    "universityImage": "https://images.unsplash.com/photo-1690454859189-6d20996335da?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OHx8SG9uZyUyMEtvbmclMjBVbml2ZXJzaXR5JTIwb2YlMjBTY2llbmNlJTIwYW5kJTIwVGVjaG5vbG9neXxlbnwwfHwwfHx8MA%3D%3D",
    "universityCountry": "Hong Kong",
    "universityCity": "Hong Kong",
    "location": "Asia",
    "universityWorldRank": 34,
    "subjectCategory": "Computer Science",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 45,
    "serviceCharge": 20,
    "applicationDeadline": "2026-02-12",
    "scholarshipPostDate": "2025-12-24",
    "postedUserEmail": "hkust.ai@asiaedu.hk"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b25",
    "scholarshipName": "UK Science Fellowship",
    "scholarshipDescription": "The UK Science Fellowship is a competitive scholarship designed to support students undertaking innovative research in various scientific disciplines. Offered by Imperial College London, this program targets students who demonstrate strong academic performance, creativity, and research potential. The fellowship encourages students to engage in cutting-edge scientific research, develop practical solutions, and contribute meaningfully to advancements in science. Selection is based on academic merit, research excellence, and the applicant’s potential impact in the scientific community.",
    "stipendCoverage": "This scholarship provides partial financial assistance to help cover tuition and research-related expenses. It includes partial tuition coverage and dedicated lab funding for research projects. While it does not fully cover all costs, the UK Science Fellowship offers valuable support, enabling students to focus on their studies, research, and professional development in science.",
    "universityName": "Imperial College London",
    "universityImage": "https://images.unsplash.com/photo-1640549700347-280bce42924f?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8SW1wZXJpYWwlMjBDb2xsZWdlJTIwTG9uZG9ufGVufDB8fDB8fHww",
    "universityCountry": "UK",
    "universityCity": "London",
    "location": "UK",
    "universityWorldRank": 8,
    "subjectCategory": "Science",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 15000,
    "applicationFees": 80,
    "serviceCharge": 40,
    "applicationDeadline": "2026-03-10",
    "scholarshipPostDate": "2025-12-25",
    "postedUserEmail": "imperial.science@ukedu.co"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b26",
    "scholarshipName": "USA Robotics Grant",
    "scholarshipDescription": "The USA Robotics Grant is a prestigious, fully-funded scholarship designed to support students who excel in robotics, artificial intelligence, and advanced engineering research. Offered by Carnegie Mellon University, this program is intended for highly motivated students with strong academic backgrounds, innovative thinking, and proven research potential in robotics and AI-driven technologies. The scholarship encourages recipients to engage in cutting-edge research, develop intelligent robotic systems, and contribute to advancements that have real-world and industry impact. Selection is based on academic excellence, research achievements, and the candidate’s potential to lead innovation in robotics and artificial intelligence.",
    "stipendCoverage": "This fully funded scholarship covers all major academic and living expenses for the duration of the program. It includes full tuition fee coverage, a monthly living stipend to support daily expenses such as housing and personal costs, and dedicated laboratory funding to support robotics and AI research activities. In addition, scholars benefit from access to advanced research facilities, faculty mentorship, and professional development opportunities, allowing them to focus fully on innovation and research excellence.",
    "universityName": "Carnegie Mellon University",
    "universityImage": "https://images.unsplash.com/photo-1586279273328-9301381ad426?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8Q2FybmVnaWUlMjBNZWxsb24lMjBVbml2ZXJzaXR5fGVufDB8fDB8fHww",
    "universityCountry": "USA",
    "universityCity": "Pittsburgh",
    "location": "USA",
    "universityWorldRank": 28,
    "subjectCategory": "Engineering",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 85,
    "serviceCharge": 45,
    "applicationDeadline": "2026-01-29",
    "scholarshipPostDate": "2025-12-26",
    "postedUserEmail": "cmu.robotics@edufinder.com"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b27",
    "scholarshipName": "Asia Business Leaders",
    "scholarshipDescription": "The Asia Business Leaders Scholarship is a prestigious, fully-funded program designed to support talented Asian students who demonstrate strong entrepreneurial mindset, leadership potential, and academic excellence in business and management fields. Offered by the Indian Institute of Technology Bombay, this scholarship aims to nurture future business leaders and innovators who can create sustainable enterprises and drive economic growth. The program encourages students to engage in entrepreneurship, strategic thinking, and leadership development while contributing positively to regional and global business ecosystems. Selection is based on academic merit, leadership qualities, and entrepreneurial potential.",
    "stipendCoverage": "This fully funded scholarship covers all major academic and living expenses, allowing students to focus entirely on their studies and leadership development. It includes full tuition fee coverage, a monthly living stipend to support daily expenses, and access to a structured mentorship program led by industry experts and academic professionals. Scholars also benefit from networking opportunities, entrepreneurial guidance, and professional development resources to support long-term career growth.",
    "universityName": "Indian Institute of Technology Bombay",
    "universityImage": "https://images.unsplash.com/photo-1726764186610-a1b2f25455fd?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTF8fEluZGlhbiUyMEluc3RpdHV0ZSUyMG9mJTIwVGVjaG5vbG9neSUyMEJvbWJheXxlbnwwfHwwfHx8MA%3D%3D",
    "universityCountry": "India",
    "universityCity": "Mumbai",
    "location": "Asia",
    "universityWorldRank": 172,
    "subjectCategory": "Business",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 40,
    "serviceCharge": 20,
    "applicationDeadline": "2026-02-20",
    "scholarshipPostDate": "2025-12-27",
    "postedUserEmail": "iitb.business@asiaedu.in"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b28",
    "scholarshipName": "UK Medical Research Grant",
    "scholarshipDescription": "This scholarship is designed to support outstanding medical students who are actively engaged in innovative and impactful research projects. It aims to encourage advancements in medical science by funding research that contributes to improved healthcare outcomes, clinical practices, and medical knowledge. Applicants are selected based on academic merit, research potential, and their commitment to advancing the field of medicine.",
    "stipendCoverage": "The scholarship offers partial financial support, including coverage of a portion of tuition fees, a monthly living stipend, and dedicated laboratory funding to assist with research-related expenses.",
    "universityName": "University of Birmingham",
    "universityImage": "https://images.unsplash.com/photo-1646315449785-3de9e4845f16?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NHx8VW5pdmVyc2l0eSUyMG9mJTIwQmlybWluZ2hhbSU1Q3xlbnwwfHwwfHx8MA%3D%3D",
    "universityCountry": "UK",
    "universityCity": "Birmingham",
    "location": "UK",
    "universityWorldRank": 92,
    "subjectCategory": "Medical",
    "scholarshipCategory": "Partial",
    "degree": "Masters",
    "tuitionFees": 14000,
    "applicationFees": 60,
    "serviceCharge": 30,
    "applicationDeadline": "2026-03-16",
    "scholarshipPostDate": "2025-12-28",
    "postedUserEmail": "birmingham.med@ukedu.co"
  },

  {
    "_id": "64f1a2b3c4d5e6f7890a1b29",
    "scholarshipName": "Canada AI Scholars",
    "scholarshipDescription": "The Canada AI Scholars program is designed to support exceptional postgraduate students who demonstrate outstanding academic performance and research potential in artificial intelligence and machine learning. Offered by the University of Montreal, this scholarship aims to foster innovation in areas such as deep learning, data-driven systems, computer vision, and intelligent algorithms. The program encourages advanced research that contributes to technological progress, ethical AI development, and real-world applications across industries. Selection is based on academic excellence, research achievements, and the potential impact of the candidate’s work in the field of artificial intelligence.",
    "stipendCoverage": "This fully funded scholarship provides comprehensive financial support to ensure scholars can focus entirely on their academic and research goals. The coverage includes full tuition fee payment, a monthly stipend to support living expenses, and dedicated laboratory funding for research activities. Scholars also benefit from access to advanced research facilities, academic mentorship, and collaborative research environments.",
    "universityName": "University of Montreal",
    "universityImage": "https://images.unsplash.com/photo-1622617892303-1fd23c256e3b?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OHx8VW5pdmVyc2l0eSUyMG9mJTIwTW9udHJlYWx8ZW58MHx8MHx8fDA%3D",
    "universityCountry": "Canada",
    "universityCity": "Montreal",
    "location": "Canada",
    "universityWorldRank": 89,
    "subjectCategory": "Computer Science",
    "scholarshipCategory": "Full Fund",
    "degree": "Masters",
    "tuitionFees": 0,
    "applicationFees": 50,
    "serviceCharge": 25,
    "applicationDeadline": "2026-01-31",
    "scholarshipPostDate": "2025-12-29",
    "postedUserEmail": "montreal.ai@canadaedu.ca"
  }
]
